conf/src/InformationRegisters/ЭП_ИсторияСообщений/ЭП_ИсторияСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ИсторияСообщений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Оповещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ЭП_ПланированиеТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/CommonModules/ЭП_НапоминанияСервер/Module.bsl
#Область ПрограммныйИнтерфейс 

Функция ПолучитьДанные() Экспорт
	
	Если Пользователи.РолиДоступны("ЭП_ИспользованиеЭП_ИсторияСообщений",,) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ИсторияСообщенийСрезПоследних.Сотрудник КАК Сотрудник,
			|	ЭП_ИсторияСообщенийСрезПоследних.Проект КАК Проект,
			|	ЭП_ИсторияСообщенийСрезПоследних.Оповещен КАК Оповещен,
			|	ЭП_ИсторияСообщенийСрезПоследних.Документ КАК Документ,
			|	ЭП_ИсторияСообщенийСрезПоследних.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЭП_ИсторияСообщений.СрезПоследних КАК ЭП_ИсторияСообщенийСрезПоследних
			|ГДЕ
			|	НЕ ЭП_ИсторияСообщенийСрезПоследних.Оповещен
			|	И ЭП_ИсторияСообщенийСрезПоследних.Сотрудник = &Сотрудник";
		
		Запрос.УстановитьПараметр("Сотрудник",Пользователи.ТекущийПользователь());
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.Оповещен = Ложь Тогда
					СтруктураНапоминание = Новый Структура;
					СтруктураНапоминание.Вставить("Проект", Выборка.Проект);
					СтруктураНапоминание.Вставить("Документ", ПолучитьНавигационнуюСсылку(Выборка.Документ)); 
					СтруктураНапоминание.Вставить("Результат", Истина);
					НаборЗаписей = РегистрыСведений.ЭП_ИсторияСообщений.СоздатьМенеджерЗаписи();
					НаборЗаписей.Период=Выборка.Период;
					НаборЗаписей.Документ=Выборка.Документ;
					НаборЗаписей.Проект=Выборка.Проект; 
					НаборЗаписей.Сотрудник=Выборка.Сотрудник;
					НаборЗаписей.Прочитать();
					Если НаборЗаписей.Выбран() Тогда
						НаборЗаписей.Оповещен = Истина;
						НаборЗаписей.Записать();
					КонецЕсли;
					Возврат СтруктураНапоминание; 
				Иначе
					СтруктураНапоминание = Новый Структура;
					СтруктураНапоминание.Вставить("Проект", Ложь);
					СтруктураНапоминание.Вставить("Документ", Ложь); 
					СтруктураНапоминание.Вставить("Результат", Ложь);
					Возврат СтруктураНапоминание;
				КонецЕсли;	
			КонецЦикла;
		Иначе
			СтруктураНапоминание = Новый Структура;
			СтруктураНапоминание.Вставить("Проект", Ложь);
			СтруктураНапоминание.Вставить("Документ", Ложь); 
			СтруктураНапоминание.Вставить("Результат", Ложь);
			Возврат СтруктураНапоминание;
		КонецЕсли;
	Иначе
		СтруктураНапоминание = Новый Структура;
		СтруктураНапоминание.Вставить("Проект", Ложь);
		СтруктураНапоминание.Вставить("Документ", Ложь); 
		СтруктураНапоминание.Вставить("Результат", Ложь);
		Возврат СтруктураНапоминание;	
	КонецЕсли;
	
КонецФункции
	
#КонецОбласти
